import csv

# '''Создание файла со словами'''

words = [
    [1, 'абажур'], [2, 'авангард'], [3, 'аванпост'], [4, 'адвокат'], [5, 'академик'],
    [6, 'бабочка'], [7, 'бегемот'], [8, 'библиотека'], [9, 'биатлон'], [10, 'благо'],
    [11, 'вагонетка'], [12, 'вегетарианец'], [13, 'ведомость'], [14, 'вёрстка'], [15, 'взаимодействие'],
    [16, 'гавань'], [17, 'гвоздика'], [18, 'гобелен'], [19, 'губернатор'], [20, 'гнездо'],
    [21, 'давление'], [22, 'двигатель'], [23, 'деавтоматизация'], [24, 'джентльмен'], [25, 'дзюдоист'],
    [26, 'жаворонок'], [27, 'жонглирование'], [28, 'жульничество'], [29, 'жемчужина'], [30, 'жонглёр'],
    [31, 'завтрак'], [32, 'запонки'], [33, 'зефир'], [34, 'импровизация'], [35, 'иллюминация']
]


FILENAME = './data/words.csv'

if __name__ == '__main__':
    with open(FILENAME, 'w', encoding='utf-8', newline='\n') as file:
        writer = csv.writer(file)
        writer.writerow([len(words)])
        writer.writerows(words)